In [165]:
import pandas as pd
import timeit

# Generators

In [51]:
it = (i for i in range(10))
n = 4

In [88]:
abc_list=['a','b','c']

In [99]:
n=2
for x,y in enumerate(abc_list):
    if x == n:
        print(f"E={x} & R={y}")

E=2 & R=c

In [97]:
n=2
for x,y in enumerate(range(6)):
    #if x == n:
        print(f"E={x} & R={y}")

E=0 & R=0
E=1 & R=1
E=2 & R=2
E=3 & R=3
E=4 & R=4
E=5 & R=5

In [ ]:
n=2
for x,y in enumerate(abc_list):
    if x == n:
        print(y)

In [79]:
def stack_overflow_gen():
    gen = (i for i in range(10))
    index = 5
    
    for i, v in enumerate(gen):
        if i is index:
            return v

stack_overflow_gen()

5

In [84]:
def stack_overflow_gen2():
    gen = (i for i in range(10))
    n = 2
    
    [_ for _ in range(n) if next(gen) and False ]
    return next(gen)

stack_overflow_gen2()

2

In [101]:
it = (i for i in range(10))
n=3
next((x for i,x in enumerate(it) if i==n), None)

3

# `lambda : `

In [102]:
# (x+4)(5)
# (5+4)

(lambda x: x+4)(5)

9

In [103]:
# (x+1)(2)
# (2+1)

(lambda x: x + 1)(2)

3

In [4]:
# (x+y)(2,3)
# (2+3)

(lambda x, y: x + y)(2, 3)

5

In [104]:
full_name = lambda first, last: f'Full name: {first.title()} {last.title()}'
full_name('Manuel','Parra')

'Full name: Manuel Parra'

# **DO** `[List Comprehension]` with `lambda : `

In [32]:
sample = [14,15,16,17,18,19,20]

In [105]:
sample_even = [x/2 for x in sample if x%2 ==0]

In [106]:
print(sample_even)

[7.0, 8.0, 9.0, 10.0]

In [107]:
test=[lambda x, i=i: x * i for i in range(4)]

# **DO** `.apply()` with `lambda : ` or `func()`

In [13]:
df = pd.DataFrame({'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],\
                   'Age' : [23, 21, 22, 21],\
                   'University' : ['BHU', 'JNU', 'DU', 'BHU'],
})

In [14]:
df.head()

        Name  Age University
0      Ankit   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

### `apply()` with `lambda : `

In [28]:
df['Age']=df['Age'].apply(lambda x : (x/2)-10)

In [29]:
df.head()

        Name   Age University
0      Ankit  23.0        BHU
1  Aishwarya  21.0        JNU
2    Shaurya  22.0         DU
3   Shivangi  21.0        BHU

In [117]:
txt = "welcome to the jungle"

x = txt.split()

print(x[3])

jungle

In [118]:
df.head()

        Name   Age University
0      Ankit  23.0        BHU
1  Aishwarya  21.0        JNU
2    Shaurya  22.0         DU
3   Shivangi  21.0        BHU

### `apply()` with `func()`

In [153]:
def double_num(df_col):
    return (df_col * 2)+10

In [154]:
df['Age']=df['Age'].apply(double_num)

In [156]:
df.head()

        Name   Age University
0      Ankit  62.0        BHU
1  Aishwarya  54.0        JNU
2    Shaurya  58.0         DU
3   Shivangi  54.0        BHU

# **DO** `map()` with `func()`

In [161]:
def addition(n):
    return n + n

numbers = (1, 2, 3, 4)
result = map(addition, numbers)
for i in result:
    print(i)

2
4
6
8

# **DON'T** `map()` with `lambda : `

In [164]:
numbers1 = [1, 2, 3]
numbers2 = [4, 5, 6]

result = map(lambda x, y: x + y, numbers1, numbers2)
for i in result:
    print(i)

5
7
9